* Ruby

#+begin_src ruby :tangle yes
  require 'set'

  input = File.open('input')
  lines = input.readlines

  def most_common_digits(lines)
    sums = Array.new(lines[0].length - 1, 0)
    lines.each_with_index do |line, line_index|
      line.each_char.with_index do |char, char_index|
        if char == '1'
          sums[char_index] += 1
        end
      end
    end

    most_common = Array.new(sums.length, 0)
    threshold = (lines.length / 2.to_f).ceil
    sums.each_with_index do |sum, index|
      if sum >= threshold
        most_common[index] = 1
      end
    end

    most_common
  end

  oxygen_candidates = lines.dup
  co2_candidates = lines.dup

  (0...lines[0].length).each do |index|
    most_common = most_common_digits(oxygen_candidates)
    oxygen_candidates.reject! { |candidate| candidate[index] != most_common[index].to_s }
    break if oxygen_candidates.length == 1
  end

  (0...lines[0].length).each do |index|
    most_common = most_common_digits(co2_candidates)
    co2_candidates.reject! { |candidate| candidate[index] == most_common[index].to_s }
    break if co2_candidates.length == 1
  end

  oxygen_candidates[0].to_i(2) * co2_candidates[0].to_i(2)
#+end_src

#+RESULTS:
: 2981085
